{
  "_name_or_path": "Neleac/timesformer-gpt2-video-captioning",
  "architectures": [
    "VisionEncoderDecoderModel"
  ],
  "decoder": {
    "_name_or_path": "gpt2",
    "activation_function": "gelu_new",
    "add_cross_attention": true,
    "architectures": [
      "GPT2LMHeadModel"
    ],
    "attn_pdrop": 0.1,
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": 50256,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "early_stopping": false,
    "embd_pdrop": 0.1,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": 50256,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "initializer_range": 0.02,
    "is_decoder": true,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "layer_norm_epsilon": 1e-05,
    "length_penalty": 1.0,
    "max_length": 20,
    "min_length": 0,
    "model_type": "gpt2",
    "n_ctx": 1024,
    "n_embd": 768,
    "n_head": 12,
    "n_inner": null,
    "n_layer": 12,
    "n_positions": 1024,
    "no_repeat_ngram_size": 0,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "remove_invalid_values": false,
    "reorder_and_upcast_attn": false,
    "repetition_penalty": 1.0,
    "resid_pdrop": 0.1,
    "return_dict": true,
    "return_dict_in_generate": false,
    "scale_attn_by_inverse_layer_idx": false,
    "scale_attn_weights": true,
    "sep_token_id": null,
    "summary_activation": null,
    "summary_first_dropout": 0.1,
    "summary_proj_to_labels": true,
    "summary_type": "cls_index",
    "summary_use_proj": true,
    "suppress_tokens": null,
    "task_specific_params": {
      "text-generation": {
        "do_sample": true,
        "max_length": 50
      }
    },
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": null,
    "torchscript": false,
    "typical_p": 1.0,
    "use_bfloat16": false,
    "use_cache": true,
    "vocab_size": 50257
  },
  "decoder_start_token_id": 50256,
  "early_stopping": true,
  "encoder": {
    "_name_or_path": "facebook/timesformer-base-finetuned-k600",
    "add_cross_attention": false,
    "architectures": [
      "TimesformerForVideoClassification"
    ],
    "attention_probs_dropout_prob": 0.0,
    "attention_type": "divided_space_time",
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "drop_path_rate": 0,
    "early_stopping": false,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": null,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 768,
    "id2label": {
      "0": "abseiling",
      "1": "acting in play",
      "2": "adjusting glasses",
      "3": "air drumming",
      "4": "alligator wrestling",
      "5": "answering questions",
      "6": "applauding",
      "7": "applying cream",
      "8": "archaeological excavation",
      "9": "archery",
      "10": "arguing",
      "11": "arm wrestling",
      "12": "arranging flowers",
      "13": "assembling bicycle",
      "14": "assembling computer",
      "15": "attending conference",
      "16": "auctioning",
      "17": "backflip (human)",
      "18": "baking cookies",
      "19": "bandaging",
      "20": "barbequing",
      "21": "bartending",
      "22": "base jumping",
      "23": "bathing dog",
      "24": "battle rope training",
      "25": "beatboxing",
      "26": "bee keeping",
      "27": "belly dancing",
      "28": "bench pressing",
      "29": "bending back",
      "30": "bending metal",
      "31": "biking through snow",
      "32": "blasting sand",
      "33": "blowdrying hair",
      "34": "blowing bubble gum",
      "35": "blowing glass",
      "36": "blowing leaves",
      "37": "blowing nose",
      "38": "blowing out candles",
      "39": "bobsledding",
      "40": "bodysurfing",
      "41": "bookbinding",
      "42": "bottling",
      "43": "bouncing on bouncy castle",
      "44": "bouncing on trampoline",
      "45": "bowling",
      "46": "braiding hair",
      "47": "breading or breadcrumbing",
      "48": "breakdancing",
      "49": "breaking boards",
      "50": "breathing fire",
      "51": "brush painting",
      "52": "brushing hair",
      "53": "brushing teeth",
      "54": "building cabinet",
      "55": "building lego",
      "56": "building sandcastle",
      "57": "building shed",
      "58": "bull fighting",
      "59": "bulldozing",
      "60": "bungee jumping",
      "61": "burping",
      "62": "busking",
      "63": "calculating",
      "64": "calligraphy",
      "65": "canoeing or kayaking",
      "66": "capoeira",
      "67": "capsizing",
      "68": "card stacking",
      "69": "card throwing",
      "70": "carrying baby",
      "71": "cartwheeling",
      "72": "carving ice",
      "73": "carving pumpkin",
      "74": "casting fishing line",
      "75": "catching fish",
      "76": "catching or throwing baseball",
      "77": "catching or throwing frisbee",
      "78": "catching or throwing softball",
      "79": "celebrating",
      "80": "changing gear in car",
      "81": "changing oil",
      "82": "changing wheel (not on bike)",
      "83": "checking tires",
      "84": "cheerleading",
      "85": "chewing gum",
      "86": "chiseling stone",
      "87": "chiseling wood",
      "88": "chopping meat",
      "89": "chopping vegetables",
      "90": "chopping wood",
      "91": "clam digging",
      "92": "clapping",
      "93": "clay pottery making",
      "94": "clean and jerk",
      "95": "cleaning gutters",
      "96": "cleaning pool",
      "97": "cleaning shoes",
      "98": "cleaning toilet",
      "99": "cleaning windows",
      "100": "climbing a rope",
      "101": "climbing ladder",
      "102": "climbing tree",
      "103": "coloring in",
      "104": "combing hair",
      "105": "contact juggling",
      "106": "contorting",
      "107": "cooking egg",
      "108": "cooking on campfire",
      "109": "cooking sausages (not on barbeque)",
      "110": "cooking scallops",
      "111": "cosplaying",
      "112": "counting money",
      "113": "country line dancing",
      "114": "cracking back",
      "115": "cracking knuckles",
      "116": "cracking neck",
      "117": "crawling baby",
      "118": "crossing eyes",
      "119": "crossing river",
      "120": "crying",
      "121": "cumbia",
      "122": "curling (sport)",
      "123": "curling hair",
      "124": "cutting apple",
      "125": "cutting nails",
      "126": "cutting orange",
      "127": "cutting pineapple",
      "128": "cutting watermelon",
      "129": "dancing ballet",
      "130": "dancing charleston",
      "131": "dancing gangnam style",
      "132": "dancing macarena",
      "133": "deadlifting",
      "134": "decorating the christmas tree",
      "135": "delivering mail",
      "136": "dining",
      "137": "directing traffic",
      "138": "disc golfing",
      "139": "diving cliff",
      "140": "docking boat",
      "141": "dodgeball",
      "142": "doing aerobics",
      "143": "doing jigsaw puzzle",
      "144": "doing laundry",
      "145": "doing nails",
      "146": "drawing",
      "147": "dribbling basketball",
      "148": "drinking shots",
      "149": "driving car",
      "150": "driving tractor",
      "151": "drooling",
      "152": "drop kicking",
      "153": "drumming fingers",
      "154": "dumpster diving",
      "155": "dunking basketball",
      "156": "dyeing eyebrows",
      "157": "dyeing hair",
      "158": "eating burger",
      "159": "eating cake",
      "160": "eating carrots",
      "161": "eating chips",
      "162": "eating doughnuts",
      "163": "eating hotdog",
      "164": "eating ice cream",
      "165": "eating spaghetti",
      "166": "eating watermelon",
      "167": "egg hunting",
      "168": "embroidering",
      "169": "exercising with an exercise ball",
      "170": "extinguishing fire",
      "171": "faceplanting",
      "172": "falling off bike",
      "173": "falling off chair",
      "174": "feeding birds",
      "175": "feeding fish",
      "176": "feeding goats",
      "177": "fencing (sport)",
      "178": "fidgeting",
      "179": "finger snapping",
      "180": "fixing bicycle",
      "181": "fixing hair",
      "182": "flint knapping",
      "183": "flipping pancake",
      "184": "fly tying",
      "185": "flying kite",
      "186": "folding clothes",
      "187": "folding napkins",
      "188": "folding paper",
      "189": "front raises",
      "190": "frying vegetables",
      "191": "geocaching",
      "192": "getting a haircut",
      "193": "getting a piercing",
      "194": "getting a tattoo",
      "195": "giving or receiving award",
      "196": "gold panning",
      "197": "golf chipping",
      "198": "golf driving",
      "199": "golf putting",
      "200": "gospel singing in church",
      "201": "grinding meat",
      "202": "grooming dog",
      "203": "grooming horse",
      "204": "gymnastics tumbling",
      "205": "hammer throw",
      "206": "hand washing clothes",
      "207": "head stand",
      "208": "headbanging",
      "209": "headbutting",
      "210": "high jump",
      "211": "high kick",
      "212": "historical reenactment",
      "213": "hitting baseball",
      "214": "hockey stop",
      "215": "holding snake",
      "216": "home roasting coffee",
      "217": "hopscotch",
      "218": "hoverboarding",
      "219": "huddling",
      "220": "hugging (not baby)",
      "221": "hugging baby",
      "222": "hula hooping",
      "223": "hurdling",
      "224": "hurling (sport)",
      "225": "ice climbing",
      "226": "ice fishing",
      "227": "ice skating",
      "228": "ice swimming",
      "229": "inflating balloons",
      "230": "installing carpet",
      "231": "ironing",
      "232": "ironing hair",
      "233": "javelin throw",
      "234": "jaywalking",
      "235": "jetskiing",
      "236": "jogging",
      "237": "juggling balls",
      "238": "juggling fire",
      "239": "juggling soccer ball",
      "240": "jumping bicycle",
      "241": "jumping into pool",
      "242": "jumping jacks",
      "243": "jumpstyle dancing",
      "244": "karaoke",
      "245": "kicking field goal",
      "246": "kicking soccer ball",
      "247": "kissing",
      "248": "kitesurfing",
      "249": "knitting",
      "250": "krumping",
      "251": "land sailing",
      "252": "laughing",
      "253": "lawn mower racing",
      "254": "laying bricks",
      "255": "laying concrete",
      "256": "laying stone",
      "257": "laying tiles",
      "258": "leatherworking",
      "259": "licking",
      "260": "lifting hat",
      "261": "lighting fire",
      "262": "lock picking",
      "263": "long jump",
      "264": "longboarding",
      "265": "looking at phone",
      "266": "luge",
      "267": "lunge",
      "268": "making a cake",
      "269": "making a sandwich",
      "270": "making balloon shapes",
      "271": "making bubbles",
      "272": "making cheese",
      "273": "making horseshoes",
      "274": "making jewelry",
      "275": "making paper aeroplanes",
      "276": "making pizza",
      "277": "making snowman",
      "278": "making sushi",
      "279": "making tea",
      "280": "making the bed",
      "281": "marching",
      "282": "marriage proposal",
      "283": "massaging back",
      "284": "massaging feet",
      "285": "massaging legs",
      "286": "massaging neck",
      "287": "massaging person's head",
      "288": "milking cow",
      "289": "moon walking",
      "290": "mopping floor",
      "291": "mosh pit dancing",
      "292": "motorcycling",
      "293": "mountain climber (exercise)",
      "294": "moving furniture",
      "295": "mowing lawn",
      "296": "mushroom foraging",
      "297": "needle felting",
      "298": "news anchoring",
      "299": "opening bottle (not wine)",
      "300": "opening door",
      "301": "opening present",
      "302": "opening refrigerator",
      "303": "opening wine bottle",
      "304": "packing",
      "305": "paragliding",
      "306": "parasailing",
      "307": "parkour",
      "308": "passing American football (in game)",
      "309": "passing american football (not in game)",
      "310": "passing soccer ball",
      "311": "peeling apples",
      "312": "peeling potatoes",
      "313": "person collecting garbage",
      "314": "petting animal (not cat)",
      "315": "petting cat",
      "316": "photobombing",
      "317": "photocopying",
      "318": "picking fruit",
      "319": "pillow fight",
      "320": "pinching",
      "321": "pirouetting",
      "322": "planing wood",
      "323": "planting trees",
      "324": "plastering",
      "325": "playing accordion",
      "326": "playing badminton",
      "327": "playing bagpipes",
      "328": "playing basketball",
      "329": "playing bass guitar",
      "330": "playing beer pong",
      "331": "playing blackjack",
      "332": "playing cello",
      "333": "playing chess",
      "334": "playing clarinet",
      "335": "playing controller",
      "336": "playing cricket",
      "337": "playing cymbals",
      "338": "playing darts",
      "339": "playing didgeridoo",
      "340": "playing dominoes",
      "341": "playing drums",
      "342": "playing field hockey",
      "343": "playing flute",
      "344": "playing gong",
      "345": "playing guitar",
      "346": "playing hand clapping games",
      "347": "playing harmonica",
      "348": "playing harp",
      "349": "playing ice hockey",
      "350": "playing keyboard",
      "351": "playing kickball",
      "352": "playing laser tag",
      "353": "playing lute",
      "354": "playing maracas",
      "355": "playing marbles",
      "356": "playing monopoly",
      "357": "playing netball",
      "358": "playing ocarina",
      "359": "playing organ",
      "360": "playing paintball",
      "361": "playing pan pipes",
      "362": "playing piano",
      "363": "playing pinball",
      "364": "playing ping pong",
      "365": "playing poker",
      "366": "playing polo",
      "367": "playing recorder",
      "368": "playing rubiks cube",
      "369": "playing saxophone",
      "370": "playing scrabble",
      "371": "playing squash or racquetball",
      "372": "playing tennis",
      "373": "playing trombone",
      "374": "playing trumpet",
      "375": "playing ukulele",
      "376": "playing violin",
      "377": "playing volleyball",
      "378": "playing with trains",
      "379": "playing xylophone",
      "380": "poking bellybutton",
      "381": "pole vault",
      "382": "polishing metal",
      "383": "popping balloons",
      "384": "pouring beer",
      "385": "preparing salad",
      "386": "presenting weather forecast",
      "387": "pull ups",
      "388": "pumping fist",
      "389": "pumping gas",
      "390": "punching bag",
      "391": "punching person (boxing)",
      "392": "push up",
      "393": "pushing car",
      "394": "pushing cart",
      "395": "pushing wheelbarrow",
      "396": "pushing wheelchair",
      "397": "putting in contact lenses",
      "398": "putting on eyeliner",
      "399": "putting on foundation",
      "400": "putting on lipstick",
      "401": "putting on mascara",
      "402": "putting on sari",
      "403": "putting on shoes",
      "404": "raising eyebrows",
      "405": "reading book",
      "406": "reading newspaper",
      "407": "recording music",
      "408": "repairing puncture",
      "409": "riding a bike",
      "410": "riding camel",
      "411": "riding elephant",
      "412": "riding mechanical bull",
      "413": "riding mule",
      "414": "riding or walking with horse",
      "415": "riding scooter",
      "416": "riding snow blower",
      "417": "riding unicycle",
      "418": "ripping paper",
      "419": "roasting marshmallows",
      "420": "roasting pig",
      "421": "robot dancing",
      "422": "rock climbing",
      "423": "rock scissors paper",
      "424": "roller skating",
      "425": "rolling pastry",
      "426": "rope pushdown",
      "427": "running on treadmill",
      "428": "sailing",
      "429": "salsa dancing",
      "430": "sanding floor",
      "431": "sausage making",
      "432": "sawing wood",
      "433": "scrambling eggs",
      "434": "scrapbooking",
      "435": "scrubbing face",
      "436": "scuba diving",
      "437": "separating eggs",
      "438": "setting table",
      "439": "sewing",
      "440": "shaking hands",
      "441": "shaking head",
      "442": "shaping bread dough",
      "443": "sharpening knives",
      "444": "sharpening pencil",
      "445": "shaving head",
      "446": "shaving legs",
      "447": "shearing sheep",
      "448": "shining flashlight",
      "449": "shining shoes",
      "450": "shooting basketball",
      "451": "shooting goal (soccer)",
      "452": "shopping",
      "453": "shot put",
      "454": "shoveling snow",
      "455": "shucking oysters",
      "456": "shuffling cards",
      "457": "shuffling feet",
      "458": "side kick",
      "459": "sign language interpreting",
      "460": "singing",
      "461": "sipping cup",
      "462": "situp",
      "463": "skateboarding",
      "464": "ski jumping",
      "465": "skiing crosscountry",
      "466": "skiing mono",
      "467": "skiing slalom",
      "468": "skipping rope",
      "469": "skipping stone",
      "470": "skydiving",
      "471": "slacklining",
      "472": "slapping",
      "473": "sled dog racing",
      "474": "sleeping",
      "475": "smashing",
      "476": "smelling feet",
      "477": "smoking",
      "478": "smoking hookah",
      "479": "smoking pipe",
      "480": "snatch weight lifting",
      "481": "sneezing",
      "482": "snorkeling",
      "483": "snowboarding",
      "484": "snowkiting",
      "485": "snowmobiling",
      "486": "somersaulting",
      "487": "spelunking",
      "488": "spinning poi",
      "489": "spray painting",
      "490": "springboard diving",
      "491": "square dancing",
      "492": "squat",
      "493": "standing on hands",
      "494": "staring",
      "495": "steer roping",
      "496": "sticking tongue out",
      "497": "stomping grapes",
      "498": "stretching arm",
      "499": "stretching leg",
      "500": "sucking lolly",
      "501": "surfing crowd",
      "502": "surfing water",
      "503": "sweeping floor",
      "504": "swimming backstroke",
      "505": "swimming breast stroke",
      "506": "swimming butterfly stroke",
      "507": "swimming front crawl",
      "508": "swing dancing",
      "509": "swinging baseball bat",
      "510": "swinging on something",
      "511": "sword fighting",
      "512": "sword swallowing",
      "513": "tackling",
      "514": "tagging graffiti",
      "515": "tai chi",
      "516": "talking on cell phone",
      "517": "tango dancing",
      "518": "tap dancing",
      "519": "tapping guitar",
      "520": "tapping pen",
      "521": "tasting beer",
      "522": "tasting food",
      "523": "tasting wine",
      "524": "testifying",
      "525": "texting",
      "526": "threading needle",
      "527": "throwing axe",
      "528": "throwing ball (not baseball or American football)",
      "529": "throwing discus",
      "530": "throwing knife",
      "531": "throwing snowballs",
      "532": "throwing tantrum",
      "533": "throwing water balloon",
      "534": "tickling",
      "535": "tie dying",
      "536": "tightrope walking",
      "537": "tiptoeing",
      "538": "tobogganing",
      "539": "tossing coin",
      "540": "training dog",
      "541": "trapezing",
      "542": "trimming or shaving beard",
      "543": "trimming shrubs",
      "544": "trimming trees",
      "545": "triple jump",
      "546": "twiddling fingers",
      "547": "tying bow tie",
      "548": "tying knot (not on a tie)",
      "549": "tying necktie",
      "550": "tying shoe laces",
      "551": "unboxing",
      "552": "unloading truck",
      "553": "using a microscope",
      "554": "using a paint roller",
      "555": "using a power drill",
      "556": "using a sledge hammer",
      "557": "using a wrench",
      "558": "using atm",
      "559": "using bagging machine",
      "560": "using circular saw",
      "561": "using inhaler",
      "562": "using puppets",
      "563": "using remote controller (not gaming)",
      "564": "using segway",
      "565": "vacuuming floor",
      "566": "visiting the zoo",
      "567": "wading through mud",
      "568": "wading through water",
      "569": "waiting in line",
      "570": "waking up",
      "571": "walking the dog",
      "572": "walking through snow",
      "573": "washing dishes",
      "574": "washing feet",
      "575": "washing hair",
      "576": "washing hands",
      "577": "watching tv",
      "578": "water skiing",
      "579": "water sliding",
      "580": "watering plants",
      "581": "waving hand",
      "582": "waxing back",
      "583": "waxing chest",
      "584": "waxing eyebrows",
      "585": "waxing legs",
      "586": "weaving basket",
      "587": "weaving fabric",
      "588": "welding",
      "589": "whistling",
      "590": "windsurfing",
      "591": "winking",
      "592": "wood burning (art)",
      "593": "wrapping present",
      "594": "wrestling",
      "595": "writing",
      "596": "yarn spinning",
      "597": "yawning",
      "598": "yoga",
      "599": "zumba"
    },
    "image_size": 224,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "abseiling": 0,
      "acting in play": 1,
      "adjusting glasses": 2,
      "air drumming": 3,
      "alligator wrestling": 4,
      "answering questions": 5,
      "applauding": 6,
      "applying cream": 7,
      "archaeological excavation": 8,
      "archery": 9,
      "arguing": 10,
      "arm wrestling": 11,
      "arranging flowers": 12,
      "assembling bicycle": 13,
      "assembling computer": 14,
      "attending conference": 15,
      "auctioning": 16,
      "backflip (human)": 17,
      "baking cookies": 18,
      "bandaging": 19,
      "barbequing": 20,
      "bartending": 21,
      "base jumping": 22,
      "bathing dog": 23,
      "battle rope training": 24,
      "beatboxing": 25,
      "bee keeping": 26,
      "belly dancing": 27,
      "bench pressing": 28,
      "bending back": 29,
      "bending metal": 30,
      "biking through snow": 31,
      "blasting sand": 32,
      "blowdrying hair": 33,
      "blowing bubble gum": 34,
      "blowing glass": 35,
      "blowing leaves": 36,
      "blowing nose": 37,
      "blowing out candles": 38,
      "bobsledding": 39,
      "bodysurfing": 40,
      "bookbinding": 41,
      "bottling": 42,
      "bouncing on bouncy castle": 43,
      "bouncing on trampoline": 44,
      "bowling": 45,
      "braiding hair": 46,
      "breading or breadcrumbing": 47,
      "breakdancing": 48,
      "breaking boards": 49,
      "breathing fire": 50,
      "brush painting": 51,
      "brushing hair": 52,
      "brushing teeth": 53,
      "building cabinet": 54,
      "building lego": 55,
      "building sandcastle": 56,
      "building shed": 57,
      "bull fighting": 58,
      "bulldozing": 59,
      "bungee jumping": 60,
      "burping": 61,
      "busking": 62,
      "calculating": 63,
      "calligraphy": 64,
      "canoeing or kayaking": 65,
      "capoeira": 66,
      "capsizing": 67,
      "card stacking": 68,
      "card throwing": 69,
      "carrying baby": 70,
      "cartwheeling": 71,
      "carving ice": 72,
      "carving pumpkin": 73,
      "casting fishing line": 74,
      "catching fish": 75,
      "catching or throwing baseball": 76,
      "catching or throwing frisbee": 77,
      "catching or throwing softball": 78,
      "celebrating": 79,
      "changing gear in car": 80,
      "changing oil": 81,
      "changing wheel (not on bike)": 82,
      "checking tires": 83,
      "cheerleading": 84,
      "chewing gum": 85,
      "chiseling stone": 86,
      "chiseling wood": 87,
      "chopping meat": 88,
      "chopping vegetables": 89,
      "chopping wood": 90,
      "clam digging": 91,
      "clapping": 92,
      "clay pottery making": 93,
      "clean and jerk": 94,
      "cleaning gutters": 95,
      "cleaning pool": 96,
      "cleaning shoes": 97,
      "cleaning toilet": 98,
      "cleaning windows": 99,
      "climbing a rope": 100,
      "climbing ladder": 101,
      "climbing tree": 102,
      "coloring in": 103,
      "combing hair": 104,
      "contact juggling": 105,
      "contorting": 106,
      "cooking egg": 107,
      "cooking on campfire": 108,
      "cooking sausages (not on barbeque)": 109,
      "cooking scallops": 110,
      "cosplaying": 111,
      "counting money": 112,
      "country line dancing": 113,
      "cracking back": 114,
      "cracking knuckles": 115,
      "cracking neck": 116,
      "crawling baby": 117,
      "crossing eyes": 118,
      "crossing river": 119,
      "crying": 120,
      "cumbia": 121,
      "curling (sport)": 122,
      "curling hair": 123,
      "cutting apple": 124,
      "cutting nails": 125,
      "cutting orange": 126,
      "cutting pineapple": 127,
      "cutting watermelon": 128,
      "dancing ballet": 129,
      "dancing charleston": 130,
      "dancing gangnam style": 131,
      "dancing macarena": 132,
      "deadlifting": 133,
      "decorating the christmas tree": 134,
      "delivering mail": 135,
      "dining": 136,
      "directing traffic": 137,
      "disc golfing": 138,
      "diving cliff": 139,
      "docking boat": 140,
      "dodgeball": 141,
      "doing aerobics": 142,
      "doing jigsaw puzzle": 143,
      "doing laundry": 144,
      "doing nails": 145,
      "drawing": 146,
      "dribbling basketball": 147,
      "drinking shots": 148,
      "driving car": 149,
      "driving tractor": 150,
      "drooling": 151,
      "drop kicking": 152,
      "drumming fingers": 153,
      "dumpster diving": 154,
      "dunking basketball": 155,
      "dyeing eyebrows": 156,
      "dyeing hair": 157,
      "eating burger": 158,
      "eating cake": 159,
      "eating carrots": 160,
      "eating chips": 161,
      "eating doughnuts": 162,
      "eating hotdog": 163,
      "eating ice cream": 164,
      "eating spaghetti": 165,
      "eating watermelon": 166,
      "egg hunting": 167,
      "embroidering": 168,
      "exercising with an exercise ball": 169,
      "extinguishing fire": 170,
      "faceplanting": 171,
      "falling off bike": 172,
      "falling off chair": 173,
      "feeding birds": 174,
      "feeding fish": 175,
      "feeding goats": 176,
      "fencing (sport)": 177,
      "fidgeting": 178,
      "finger snapping": 179,
      "fixing bicycle": 180,
      "fixing hair": 181,
      "flint knapping": 182,
      "flipping pancake": 183,
      "fly tying": 184,
      "flying kite": 185,
      "folding clothes": 186,
      "folding napkins": 187,
      "folding paper": 188,
      "front raises": 189,
      "frying vegetables": 190,
      "geocaching": 191,
      "getting a haircut": 192,
      "getting a piercing": 193,
      "getting a tattoo": 194,
      "giving or receiving award": 195,
      "gold panning": 196,
      "golf chipping": 197,
      "golf driving": 198,
      "golf putting": 199,
      "gospel singing in church": 200,
      "grinding meat": 201,
      "grooming dog": 202,
      "grooming horse": 203,
      "gymnastics tumbling": 204,
      "hammer throw": 205,
      "hand washing clothes": 206,
      "head stand": 207,
      "headbanging": 208,
      "headbutting": 209,
      "high jump": 210,
      "high kick": 211,
      "historical reenactment": 212,
      "hitting baseball": 213,
      "hockey stop": 214,
      "holding snake": 215,
      "home roasting coffee": 216,
      "hopscotch": 217,
      "hoverboarding": 218,
      "huddling": 219,
      "hugging (not baby)": 220,
      "hugging baby": 221,
      "hula hooping": 222,
      "hurdling": 223,
      "hurling (sport)": 224,
      "ice climbing": 225,
      "ice fishing": 226,
      "ice skating": 227,
      "ice swimming": 228,
      "inflating balloons": 229,
      "installing carpet": 230,
      "ironing": 231,
      "ironing hair": 232,
      "javelin throw": 233,
      "jaywalking": 234,
      "jetskiing": 235,
      "jogging": 236,
      "juggling balls": 237,
      "juggling fire": 238,
      "juggling soccer ball": 239,
      "jumping bicycle": 240,
      "jumping into pool": 241,
      "jumping jacks": 242,
      "jumpstyle dancing": 243,
      "karaoke": 244,
      "kicking field goal": 245,
      "kicking soccer ball": 246,
      "kissing": 247,
      "kitesurfing": 248,
      "knitting": 249,
      "krumping": 250,
      "land sailing": 251,
      "laughing": 252,
      "lawn mower racing": 253,
      "laying bricks": 254,
      "laying concrete": 255,
      "laying stone": 256,
      "laying tiles": 257,
      "leatherworking": 258,
      "licking": 259,
      "lifting hat": 260,
      "lighting fire": 261,
      "lock picking": 262,
      "long jump": 263,
      "longboarding": 264,
      "looking at phone": 265,
      "luge": 266,
      "lunge": 267,
      "making a cake": 268,
      "making a sandwich": 269,
      "making balloon shapes": 270,
      "making bubbles": 271,
      "making cheese": 272,
      "making horseshoes": 273,
      "making jewelry": 274,
      "making paper aeroplanes": 275,
      "making pizza": 276,
      "making snowman": 277,
      "making sushi": 278,
      "making tea": 279,
      "making the bed": 280,
      "marching": 281,
      "marriage proposal": 282,
      "massaging back": 283,
      "massaging feet": 284,
      "massaging legs": 285,
      "massaging neck": 286,
      "massaging person's head": 287,
      "milking cow": 288,
      "moon walking": 289,
      "mopping floor": 290,
      "mosh pit dancing": 291,
      "motorcycling": 292,
      "mountain climber (exercise)": 293,
      "moving furniture": 294,
      "mowing lawn": 295,
      "mushroom foraging": 296,
      "needle felting": 297,
      "news anchoring": 298,
      "opening bottle (not wine)": 299,
      "opening door": 300,
      "opening present": 301,
      "opening refrigerator": 302,
      "opening wine bottle": 303,
      "packing": 304,
      "paragliding": 305,
      "parasailing": 306,
      "parkour": 307,
      "passing American football (in game)": 308,
      "passing american football (not in game)": 309,
      "passing soccer ball": 310,
      "peeling apples": 311,
      "peeling potatoes": 312,
      "person collecting garbage": 313,
      "petting animal (not cat)": 314,
      "petting cat": 315,
      "photobombing": 316,
      "photocopying": 317,
      "picking fruit": 318,
      "pillow fight": 319,
      "pinching": 320,
      "pirouetting": 321,
      "planing wood": 322,
      "planting trees": 323,
      "plastering": 324,
      "playing accordion": 325,
      "playing badminton": 326,
      "playing bagpipes": 327,
      "playing basketball": 328,
      "playing bass guitar": 329,
      "playing beer pong": 330,
      "playing blackjack": 331,
      "playing cello": 332,
      "playing chess": 333,
      "playing clarinet": 334,
      "playing controller": 335,
      "playing cricket": 336,
      "playing cymbals": 337,
      "playing darts": 338,
      "playing didgeridoo": 339,
      "playing dominoes": 340,
      "playing drums": 341,
      "playing field hockey": 342,
      "playing flute": 343,
      "playing gong": 344,
      "playing guitar": 345,
      "playing hand clapping games": 346,
      "playing harmonica": 347,
      "playing harp": 348,
      "playing ice hockey": 349,
      "playing keyboard": 350,
      "playing kickball": 351,
      "playing laser tag": 352,
      "playing lute": 353,
      "playing maracas": 354,
      "playing marbles": 355,
      "playing monopoly": 356,
      "playing netball": 357,
      "playing ocarina": 358,
      "playing organ": 359,
      "playing paintball": 360,
      "playing pan pipes": 361,
      "playing piano": 362,
      "playing pinball": 363,
      "playing ping pong": 364,
      "playing poker": 365,
      "playing polo": 366,
      "playing recorder": 367,
      "playing rubiks cube": 368,
      "playing saxophone": 369,
      "playing scrabble": 370,
      "playing squash or racquetball": 371,
      "playing tennis": 372,
      "playing trombone": 373,
      "playing trumpet": 374,
      "playing ukulele": 375,
      "playing violin": 376,
      "playing volleyball": 377,
      "playing with trains": 378,
      "playing xylophone": 379,
      "poking bellybutton": 380,
      "pole vault": 381,
      "polishing metal": 382,
      "popping balloons": 383,
      "pouring beer": 384,
      "preparing salad": 385,
      "presenting weather forecast": 386,
      "pull ups": 387,
      "pumping fist": 388,
      "pumping gas": 389,
      "punching bag": 390,
      "punching person (boxing)": 391,
      "push up": 392,
      "pushing car": 393,
      "pushing cart": 394,
      "pushing wheelbarrow": 395,
      "pushing wheelchair": 396,
      "putting in contact lenses": 397,
      "putting on eyeliner": 398,
      "putting on foundation": 399,
      "putting on lipstick": 400,
      "putting on mascara": 401,
      "putting on sari": 402,
      "putting on shoes": 403,
      "raising eyebrows": 404,
      "reading book": 405,
      "reading newspaper": 406,
      "recording music": 407,
      "repairing puncture": 408,
      "riding a bike": 409,
      "riding camel": 410,
      "riding elephant": 411,
      "riding mechanical bull": 412,
      "riding mule": 413,
      "riding or walking with horse": 414,
      "riding scooter": 415,
      "riding snow blower": 416,
      "riding unicycle": 417,
      "ripping paper": 418,
      "roasting marshmallows": 419,
      "roasting pig": 420,
      "robot dancing": 421,
      "rock climbing": 422,
      "rock scissors paper": 423,
      "roller skating": 424,
      "rolling pastry": 425,
      "rope pushdown": 426,
      "running on treadmill": 427,
      "sailing": 428,
      "salsa dancing": 429,
      "sanding floor": 430,
      "sausage making": 431,
      "sawing wood": 432,
      "scrambling eggs": 433,
      "scrapbooking": 434,
      "scrubbing face": 435,
      "scuba diving": 436,
      "separating eggs": 437,
      "setting table": 438,
      "sewing": 439,
      "shaking hands": 440,
      "shaking head": 441,
      "shaping bread dough": 442,
      "sharpening knives": 443,
      "sharpening pencil": 444,
      "shaving head": 445,
      "shaving legs": 446,
      "shearing sheep": 447,
      "shining flashlight": 448,
      "shining shoes": 449,
      "shooting basketball": 450,
      "shooting goal (soccer)": 451,
      "shopping": 452,
      "shot put": 453,
      "shoveling snow": 454,
      "shucking oysters": 455,
      "shuffling cards": 456,
      "shuffling feet": 457,
      "side kick": 458,
      "sign language interpreting": 459,
      "singing": 460,
      "sipping cup": 461,
      "situp": 462,
      "skateboarding": 463,
      "ski jumping": 464,
      "skiing crosscountry": 465,
      "skiing mono": 466,
      "skiing slalom": 467,
      "skipping rope": 468,
      "skipping stone": 469,
      "skydiving": 470,
      "slacklining": 471,
      "slapping": 472,
      "sled dog racing": 473,
      "sleeping": 474,
      "smashing": 475,
      "smelling feet": 476,
      "smoking": 477,
      "smoking hookah": 478,
      "smoking pipe": 479,
      "snatch weight lifting": 480,
      "sneezing": 481,
      "snorkeling": 482,
      "snowboarding": 483,
      "snowkiting": 484,
      "snowmobiling": 485,
      "somersaulting": 486,
      "spelunking": 487,
      "spinning poi": 488,
      "spray painting": 489,
      "springboard diving": 490,
      "square dancing": 491,
      "squat": 492,
      "standing on hands": 493,
      "staring": 494,
      "steer roping": 495,
      "sticking tongue out": 496,
      "stomping grapes": 497,
      "stretching arm": 498,
      "stretching leg": 499,
      "sucking lolly": 500,
      "surfing crowd": 501,
      "surfing water": 502,
      "sweeping floor": 503,
      "swimming backstroke": 504,
      "swimming breast stroke": 505,
      "swimming butterfly stroke": 506,
      "swimming front crawl": 507,
      "swing dancing": 508,
      "swinging baseball bat": 509,
      "swinging on something": 510,
      "sword fighting": 511,
      "sword swallowing": 512,
      "tackling": 513,
      "tagging graffiti": 514,
      "tai chi": 515,
      "talking on cell phone": 516,
      "tango dancing": 517,
      "tap dancing": 518,
      "tapping guitar": 519,
      "tapping pen": 520,
      "tasting beer": 521,
      "tasting food": 522,
      "tasting wine": 523,
      "testifying": 524,
      "texting": 525,
      "threading needle": 526,
      "throwing axe": 527,
      "throwing ball (not baseball or American football)": 528,
      "throwing discus": 529,
      "throwing knife": 530,
      "throwing snowballs": 531,
      "throwing tantrum": 532,
      "throwing water balloon": 533,
      "tickling": 534,
      "tie dying": 535,
      "tightrope walking": 536,
      "tiptoeing": 537,
      "tobogganing": 538,
      "tossing coin": 539,
      "training dog": 540,
      "trapezing": 541,
      "trimming or shaving beard": 542,
      "trimming shrubs": 543,
      "trimming trees": 544,
      "triple jump": 545,
      "twiddling fingers": 546,
      "tying bow tie": 547,
      "tying knot (not on a tie)": 548,
      "tying necktie": 549,
      "tying shoe laces": 550,
      "unboxing": 551,
      "unloading truck": 552,
      "using a microscope": 553,
      "using a paint roller": 554,
      "using a power drill": 555,
      "using a sledge hammer": 556,
      "using a wrench": 557,
      "using atm": 558,
      "using bagging machine": 559,
      "using circular saw": 560,
      "using inhaler": 561,
      "using puppets": 562,
      "using remote controller (not gaming)": 563,
      "using segway": 564,
      "vacuuming floor": 565,
      "visiting the zoo": 566,
      "wading through mud": 567,
      "wading through water": 568,
      "waiting in line": 569,
      "waking up": 570,
      "walking the dog": 571,
      "walking through snow": 572,
      "washing dishes": 573,
      "washing feet": 574,
      "washing hair": 575,
      "washing hands": 576,
      "watching tv": 577,
      "water skiing": 578,
      "water sliding": 579,
      "watering plants": 580,
      "waving hand": 581,
      "waxing back": 582,
      "waxing chest": 583,
      "waxing eyebrows": 584,
      "waxing legs": 585,
      "weaving basket": 586,
      "weaving fabric": 587,
      "welding": 588,
      "whistling": 589,
      "windsurfing": 590,
      "winking": 591,
      "wood burning (art)": 592,
      "wrapping present": 593,
      "wrestling": 594,
      "writing": 595,
      "yarn spinning": 596,
      "yawning": 597,
      "yoga": 598,
      "zumba": 599
    },
    "layer_norm_eps": 1e-06,
    "length_penalty": 1.0,
    "max_length": 20,
    "min_length": 0,
    "model_type": "timesformer",
    "no_repeat_ngram_size": 0,
    "num_attention_heads": 12,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_channels": 3,
    "num_frames": 8,
    "num_hidden_layers": 12,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "patch_size": 16,
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "qkv_bias": true,
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "sep_token_id": null,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": "float32",
    "torchscript": false,
    "typical_p": 1.0,
    "use_bfloat16": false
  },
  "is_encoder_decoder": true,
  "max_length": 50,
  "model_type": "vision-encoder-decoder",
  "num_beams": 4,
  "pad_token_id": 50256,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.34.0"
}
